// Домашнее задание будет полной копией задач из первых лекций для python. Нужно реализовать логику и сравнить подходы двух языков.

// 1.Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон
// 2.Напишите программу, которая спрашивает у пользователя два числа и знак: "+" или "-". В зависимости от знака выводит их сумму или разницу
// + Напишите программу, которая находит все простые числа между 0 и пользовательским числом
//
// + Напишите программу, которая выводит все кратные 5 числа между двумя пользовательскими числами
//
// + Создать лист из 6 любых чисел. Отсортировать его по возрастанию
//
// + Создать словарь из 5 пар: int -> str, например {6: '6'}, вывести его в консоль попарно
//
// + Создать tuple из 10 любых дробных чисел, найти максимальное и минимальное значение в нем
//
// + Создать лист из 3 слов: ['Earth', 'Russia', 'Moscow'], соеденить все слова в единую строку, чтобы получилось: 'Earth -> Russia -> Moscow'
//
// + Взять строку '/bin:/usr/bin:/usr/local/bin' и разбить ее в список по символу ':'
//
// + Пройти по всем числам от 1 до 100, написать в консоль, какие из них делятся на 7, а какие - нет
//
// + Создать матрицу любых чисел 3 на 4, сначала вывести все строки, потом все столбцы
//
// + Создать список любых объектов, в цикле напечатать в консоль: объект и его индекс
//
// + Создать список с тремя значениями 'to-delete' и нескольми любыми другими, удалить из него все значения 'to-delete'
//
// + Пройти по всем числам от 1 до 10 в обратную сторону (то есть: от 10 до 1), напечатать их в консоль
